Repository: fizzyizzy05/binary
Catalog: po/*.po
Languages: ar, de, el, ru, te, uk

source: binary;decimal;hexadecimal;base;convert;
ar: ثنائي;عشري;ست عشري;قاعدة;قاعدي;تحويل;binary;decimal;hexadecimal;base;convert;
de: binär;dezimal;hexadezimal;basis;konvertieren;
el: δυαδικό;δεκαδικό;δεκαεξαδικό;βάση;μετατροπή;
ru: двоичная;десятичная;шестнадцатеричная;база;конвертировать;
uk: binary;decimal;hexadecimal;base;convert;бінарність;десятковий;шістнадцятковий;база;основа;конвертація;конвертувати;число;числа;цифра;цифру;

source: Number base converter
de: Zahlenbasen Konverter
ru: Преобразователь чисел

source: A small and simple app used to convert between different hexadecimal and binary numbers
ar: تطبيق صغير وبسيط يستخدم للتحويل بين الأنظمة الست عشرية والثنائية المختلفة
de: Eine kleine und simple Anwendung zur Konvertierung zwischen Binären, Dezimalen und Hexadezimalen Zahlen
el: Μια μικρή και απλή εφαρμογή για την μετατροπή μεταξύ διαφορετικών δεκαεξαδικών και δυαδικών αριθμών
ru: Небольшое и простое приложение для преобразования различных шестнадцатеричных и двоичных чисел
te: వివిధ హెక్సాడెసిమల్ మరియు బైనరీ సంఖ్యల మధ్య మార్చడానికి ఉపయోగించే ఒక చిన్న మరియు సరళమైన అనువర్తనం
uk: Простий та маленький додаток для конвертації між різними шістнадцятковими та двійковими числами

source: Binary window converting 12 to 1100
de: Binary Fenster konvertiert 12 zu 1100

source: Binary 0.2.1 is a small update to the base converter app, with the following improvements
de: Binary 0.2.1 enthält ein kleines Update für die Basis Konverter Anwendung mit folgenden Verbesserungen
ru: Binary 0.2.1 - это небольшое обновление базового приложения-конвертера, содержащее следующие улучшения

source: Dark/light mode switch in a new preferences window
de: Schalter im neuen Einstellungsfenster für Dunkles/Helles Thema
ru: Переключение темного/светлого стиля в новом окне настроек

source: Turkish translations
de: Türkische Übersetzung
ru: Турецкий перевод

source: Accessibility improvements
de: Verbesserung der Barrierefreiheit
ru: Улучшения доступности

source: Binary 0.2 is the latest update to the base converter app. This update introduces hexadecimal (or base 16) as a number base, allowing for conversions to and from hexadecimal numbers. The app also now has a green accent colour, making it feel more fun and distinctive. And invalid digits are now removed from the input box, making the app smoother and easier to use.
de: Binary 0.2 ist das neueste Update zur Verbesserung der App. Das Update fügt die Umwandlung von und zu Hexadezimalzahlen (Basis 16) hinzu. Außerdem hat die App jetzt einen Grünen Farbakzent, welcher die App hervorhebt. Auch unpassende Zeichen werden nun automatisch aus der Eingabe entfernt.
ru: Binary 0.2 - это последнее обновление приложения для преобразования чисел. В этом обновлении в качестве основы для чисел введена шестнадцатеричная система (или основание 16), что позволяет конвертировать в шестнадцатеричные числа и обратно. Кроме того, приложение теперь имеет зеленый акцентный цвет, что делает его более забавным и заметным. А недействительные цифры теперь удаляются из поля ввода, что делает приложение более плавным и простым в использовании.

source: Additionally, the following bug fixes and smaller improvements have been made:
de: Zusätzlich gibt es folgende Bugfixes und kleine Verbesserungen:
ru: Кроме того, были исправлены следующие ошибки и внесены небольшие улучшения:

source: The output is now selectable, allowing for copy and paste instead of needing to manually type out the result.
de: Die Ausgabe ist jetzt auswählbar. Es funktionieren jetzt auch Einfügen und Kopieren anstatt manuell abtippen zu müssen.
ru: Вывод теперь можно выделять, что позволяет копировать и вставлять результат вместо того, чтобы набирать его вручную.

source: Decimal input now has data validation, and will display a toast when using an invalid digit.
de: Die Dezimaleingabe hat nun Datenverifizierung und wird einen Toast bei ungültigen Zeichen anzeigen.
ru: Десятичный ввод теперь имеет проверку данных и отображает тост при использовании недопустимой цифры.

source: Wrong digit toasts will no longer duplicate, and will simply stay up when an invalid base is used.
de: Toast für ungültige Zeichen wird nur noch einmal, statt pro falschem Zeichen, angezeigt.
ru: Тосты с неправильными цифрами больше не будут дублироваться, а просто останутся на месте, если используется недействительное основание.

source: The bit counter has been updated to be cleaner and easier to understand.
de: Der Bit-Zähler wurde für bessere Lesbarkeit angepasst.
ru: Счетчик битов был обновлен, чтобы стать чище и понятнее.

source: When entering an invalid digit, it no longer removes it to prevent GTK Warnings. This functionality will likely be revisited down the line
de: Ungültige Zeichen werden nicht mehr entfernt, um GTK Warnungen zu verhindern. Diese Funktionalität wird wahrscheinlich später wieder implementiert werden
ru: При вводе недопустимой цифры она больше не удаляется, чтобы предотвратить появление предупреждений GTK. Эта функциональность, вероятно, будет пересмотрена в будущем

source: Removed preferences button as it was empty and did nothing
de: Einstellungsmenüpunkt entfernt, da es keine Einstellungen gibt
ru: Удалена кнопка настроек, поскольку она была пустой и ничего не делала

source: The bit counter doesn't start with "0 bits" anymore, and should have consistent functionality.
de: Der Bit-Zähler startet nicht mehr mit “0 Bits” und sollte ab jetzt konsistente Ausgaben liefern.
ru: Счетчик битов больше не начинается с "0 бит" и должен иметь согласованную функциональность.

source: Added links to the project in the about window
de: Links über das Projekt zum “Über Binary”-Dialog hinzugefügt
ru: Добавлены ссылки на проект в окне "О программе"

source: The "Legal" section in the about window now states the GPL v3 license of the app
de: Die “Rechtshinweise”-Sektion im “Über Binary”-Dialog zeigt nun die GPL-3.0 Lizens der Anwendung an
ru: В разделе "Правовая информация" в окне "О программе" теперь указана лицензия GPL v3 на приложение

source: Code cleanup
de: Quellcode aufgeräumt
ru: Чистка кода

source: Version bump
de: Version erhöht
ru: Работа с версиями

source: Swap button for base switcher
de: Knopf zum Wechseln von Ein- und Ausgabe hinzugefügt
ru: Кнопка смены для переключателя основания

source: Removed the binary calculator label
de: Binärrechner-Label entfernt
ru: Удалена метка двоичного калькулятора

source: First proper release of Binary. Has basic support for converting between binary and hexadecmial values.
de: Erster Release von Binary. Grundlegende Unterstützung für die Konvertierung zwischen Binär- und Hexadezimalzahlen.
ru: Первый полноценный релиз Binary. Имеет базовую поддержку конвертации между двоичными и шестнадцатеричными значениями.

# shortcut window
source: General
ar: عام
de: Allgemein
el: Γενικά
ru: Общие
te: జనరల్
uk: Загальні

# shortcut window
source: Show Shortcuts
ar: اعرض الاختصارات
de: Tastenkürzel anzeigen
el: Ένδειξη συντομεύσεων
ru: Показать горячие клавиши
te: సత్వరమార్గాలను చూపు
uk: Показати клавіатурні скорочення

# shortcut window
source: Quit
ar: أنهِ
de: Schließen
el: Έξοδος
ru: Завершить
te: నిష్క్రమించు
uk: Вийти

# shortcut window
source: Preferences
de: Einstellungen

source: translator-credits
ar: أحمد النجماوي <iramosu@protonmail.com>
de: Konstantin Tutsch <mail@konstantintutsch.com>
el: Πέτρος Κονόμης
te: Aryan Karamtoth
uk: freeducks-debug

source: Decimal only accepts the digits 0-9
de: Dezimalzahlen enthalten nur die Zeichen 0-9

source: Binary only accepts the digits 0 and 1
de: Binärzahlen enthalten nur die Zeichen 0 und 1

source: Hexadecimal only accepts the digits 0-9 and A-F
de: Hexadezimalzahlen enthalten nur die Zeichen 0-9 und A-F

source: Input and output bases are the same
de: Die Basen der Ein- und Ausgabe sind identisch

source: Main Menu
ar: القائمة الرئيسة
de: Hauptmenü
el: Κυρίως μενού
ru: Главное меню
te: ప్రధాన మెనూ
uk: Головне меню

source: Enter numbers…
ar: أدخِل الأرقام…
de: Zahl eingeben…
el: Εισαγωγή αριθμών…
ru: Введите числа…
te: నంబర్లను నమోదు చేయండి...
uk: Введіть числа…

source: Dec
de: Dez

source: _Preferences
de: _Einstellungen

source: _Keyboard Shortcuts
ar: ا_ختصارات لوحة المفاتيح
de: _Tastenkürzel
el: _Συντομεύσεις πληκτρολογίου
ru: _Горячие клавиши
te: కీబోర్డ్ సత్వరమార్గాలు (_K)
uk: _Клавіатурні скорочення

source: _About Binary
ar: _عَنْ «ثنائي»
de: _Über Binary
el: _Πέρι του Δυαδικού
ru: _О программе Binary
te: బైనరీ గురించి (_A)
uk: _Про "Бінарність"

source: Preferences
ar: التفضيلات
de: Einstellungen
el: Προτιμήσεις
ru: Настройки
te: ప్రాధాన్యతలు
uk: Налаштування

source: Colour scheme
de: Farbschema

source: Follow System
de: Systemeinstellungen

source: Light Theme
de: Hell

source: Dark Theme
de: Dunkel

source: Binary window converting 37 to 1F
ru: Окно приложения, преобразующее 37 в 1F

source: Binary 0.3 is a new release with the following improvements:
ru: Binary 0.3 - это новый выпуск со следующими улучшениями:

source: A new cleaner design for the base selectors for the headers.
ru: Новый более чистый дизайн базовых селекторов для заголовков.

source: Added support for converting numbers between octal and other bases.
ru: Добавлена поддержка преобразования чисел между восьмеричной и другими системами.

source: Reworked number conversions to be more reliable and quicker.
ru: Переработано преобразование чисел, чтобы сделать его более надежным и быстрым.

source: Added translations for the following locales:
ru: Добавлены переводы на следующие языки:

source: German (Konstantin Tutsch)
ru: Немецкий (Konstantin Tutsch)

source: Finnish (Jiri Grönroos)
ru: Финский (Jiri Grönroos)

source: Isabelle Jackson
ru: Изабелль Джексон

source: bits
ar: تُستخدم في عدّاد البِتَّات لبيان عدد البِتَّات التي يحتويها المُدخل/المُخرج الثنائي
el: δυαδικά ψηφία
ru: бит
te: బిట్స్
uk: біти

source: Input Base
ar: قاعدة المدخلات
el: Βάση εισόδου
ru: Входное основание
te: ఇన్పుట్ బేస్
uk: Ввідна основа

source: Output Base
ar: قاعدة المخرجات
el: Βάση εξόδου
ru: Выходное основание
te: అవుట్పుట్ బేస్
uk: Вихідна основа

source: Binary
ar: ثنائي
el: Δυαδικό
te: బైనరీ
uk: Бінарність

source: Convert numbers between bases
ar: حوِّل الأرقام بين القواعد
el: Μετατροπή αριθμών μεταξύ βάσεων
te: సంఖ్యలను స్థావరాల మధ్య మార్చండి
uk: Конвертація чисел між основами

source: Binary window converting 101010 in binary to 42 in decimal
ar: نافذة «ثنائي» تحوِّل 101010 من النظام الثنائي إلى 42 في النظام العشري
el: Δυαδικό παράθυρο μετατρέποντας από 101010 δυαδικό σε 42 δεκαδικό
te: బైనరీ విండో బైనరీలో 101010 ను దశాంశంలో 42 గా మారుస్తుంది.
uk: Вікно "Бінарність", конвертація 101010 у двійковому форматі в 42 в десятковий

source: Binary window converting 1201 in decimal to 4B1 in hexadecimal
ar: نافذة «ثنائي» تحوِّل 1201 من النظام العشري إلى 4B1 في النظام الست عشري
el: Δυαδικό παράθυρο μετατρέποντας από 1201 δεκαδικό σε 4Β1 δεκαεξαδικό
te: బైనరీ విండో దశాంశంలో 1201 ను హెక్సాడెసిమల్‌లో 4B1 గా మారుస్తుంది
uk: Вікно "Бінарність", конвертація 1201 в десятковому форматі в 4B1 в шістнадцятковий

source: Binary window converting 17 in octal to F in hexadecimal
ar: نافذة «ثنائي» تحوِّل 17 من النظام الثماني إلى F في النظام الست عشري
el: Δυαδικό παράθυρο μετατρέποντας από 17 οκταδικό σε F δεκαεξαδικό
te: బైనరీ విండో అష్టాంశంలో 17 ను హెక్సాడెసిమల్‌లో F గా మారుస్తుంది
uk: Вікно "Бінарність", конвертація 17 в вісімковому форматі в F у шістнадцятковому

# shortcut window
source: New Window
ar: نافذة جديدة
el: Νέο παράθυρο
te: కొత్త విండో
uk: Нове вікно

# shortcut window
source: Close Window
ar: أغلِق النافذة
el: Κλείσιμο παραθύρου
te: విండోను మూసివేయండి
uk: Закрити вікно

source: Octal
ar: ثماني
el: Οκταδικό
te: ఆక్టల్
uk: Вісімкове число

source: Decimal
ar: عشري
el: Δεκαδικό
te: దశాంశం
uk: Десяткове число

source: Hexadecimal
ar: ست عشري
el: Δεκαεξαδικό
te: హెక్సాడెసిమల్
uk: Шістнадцяткове число

source: Other
ar: أخرى
el: 'Αλλες βάσεις
te: ఇతర
uk: Інше

source: Invalid input
ar: مدخلة غير صالحة
el: Μη έγκυρη είσοδος
te: చెల్లని ఇన్‌పుట్
uk: Не правильно введені дані

source: %(in_count)d bit
ar: %(in_count)d بِت
el: %(in_count)d δυαδικό ψηφίο
te: %(in_count)d బిట్
uk: %(in_count)d біт

source: %(out_count)d bit
ar: %(out_count)d بِت
el: %(out_count)d δυαδικό ψηφίο
te: %(out_count)d బిట్స్
uk: %(out_count)d біт

source: Enter numbers
ar: أدخِل الأرقام
el: Εισαγωγή αριθμών
te: సంఖ్యలను నమోదు చేయండి
uk: Введіть числа

source: New Window
ar: نافذة جديدة
el: Νέο παράθυρο
te: కొత్త విండో
uk: Нове вікно
